// automatically generated by ida2asm, do not edit!

#pragma once

#include "swos.h"

struct MenuEntry;

#pragma pack(push, 1)
// 68k register, 32-bit value, support for accessing as byte/word/dword and various casts
struct Register
{
    Register() {}
    Register(byte b) : data(b) {}
    Register(word w) : data(w) {}
    Register(dword d) : data(d) {}
    Register(int i) : data(i) {}
#ifdef PTR32
    Register(const char *p) : data(reinterpret_cast<dword>(p)) {}
#endif
    template<typename T> Register(const SwosDataPointer<T>& ptr) : data(ptr.getRaw()) {}
    template <typename T, typename std::enable_if_t<std::is_pointer<T>::value, T> = nullptr>
    Register(T t) {
        auto offset = SwosVM::ptrToOffset(t);
        assign<dword>(offset);
    }
    template <typename T, typename std::enable_if_t<!std::is_pointer<T>::value, T> = 0>
    Register(T t) {
        assign<T>(t);
    }
    template <typename T>
    void assign(typename std::enable_if<std::is_convertible<T, dword>::value, T>::type t) {
        data = static_cast<dword>(t);
    }
    template <typename T>
    void assign(typename std::enable_if<!std::is_convertible<T, dword>::value, T>::type t) {
        data = reinterpret_cast<dword>(t);
    }
    word asWord() const { return static_cast<word>(data); }
    int16_t asInt16() const { return static_cast<int16_t>(data); }
    dword asDword() const { return static_cast<dword>(data); }
    int asInt() const { return static_cast<int>(data); }
    template <typename T> typename std::enable_if<std::is_convertible<T, dword>::value, T>::type as() {
         return static_cast<T>(data);
    }
    template <typename T> typename std::enable_if<std::is_pointer<T>::value, T>::type as() {
        return reinterpret_cast<T>(SwosVM::offsetToPtr(data));
    }
    template <typename T> typename std::enable_if<!std::is_pointer<T>::value && !std::is_convertible<T, dword>::value, T>::type as() {
        return reinterpret_cast<T>(data);
    }
    char *asPtr() { return reinterpret_cast<char *>(SwosVM::offsetToPtr(data)); }
    const char *asConstPtr() const { return reinterpret_cast<char *>(SwosVM::offsetToPtr(data)); }
    template <typename T> operator T*() const { return reinterpret_cast<T *>(SwosVM::offsetToPtr(data)); }
    MenuEntry *asMenuEntry() { return as<MenuEntry *>(); }
    operator dword() const { return data; }
    Register& operator+=(size_t n) { data += n; return *this; }
    Register& operator^=(size_t n) { data ^= n; return *this; }
    Register& operator|=(size_t n) { data |= n; return *this; }
    Register& operator++() { data++; return *this; }
    Register operator++(int) { Register old(*this); data++; return old; }
    Register& operator--() { data--; return *this; }
    Register operator--(int) { Register old(*this); data--; return old; }

    union {
        dword data;
        struct {
            uint16_t lo16;
            uint16_t hi16;
        };
        struct {
            uint8_t lo8;
            uint8_t hi8;
        };
    };
};
#pragma pack(pop)

struct MenuBase;

extern Register D0, D1, D2, D3, D4, D5, D6, D7, A0, A1, A2, A3, A4, A5, A6;
extern void CommonMenuExit();
extern void SetExitMenuFlag();
extern void CalcMenuEntryAddress();
extern void EditTacticsMenu();
extern void FriendlyMenu();
extern void DIYCompetitionMenu();
extern void PresetCompetitionMenu();
extern void SeasonMenu();
extern void CareerMenu();
extern void StartContest();
extern void SaveContest();
extern void LoadOldCompetitionMenu();
extern void EditCustomTeamMenu();
extern void ExitSelectTeams();
extern void InitCareerVariables();
extern void SetDefaultNameAndSurname();
extern void InitHighestScorersTable();
extern void InitUserTactics();
extern void ApplyTeamTactics();
extern void ChangeGameLength();
extern void ChangePitchType();
extern void ChangeAutoReplays();
extern void ChangeAllPlTeamsEqual();
extern void ChangeAutoSaveHighlights();
extern void SetPlayerAnimationTable();
extern void GoalkeeperClaimedTheBall();
extern void ExtractSurname();
extern void UpdateBall();
extern void DoGoalkeeperSprites();
extern void MarkPlayer();
extern void UpdateControlledPlayerNumbers();
extern void InitAndPlayGame();
extern void UpdateCameraBreakMode();
extern void UpdateControlledPlayer();
extern void UpdatePlayerBeingPassedTo();
extern void UpdatePlayerInjuries();
extern void AssignFakeGoalsToScorers();
extern void SetInGameTeamsPrimaryColors();
extern void SetNextPlayerFrame();
extern void cseg_2F0E2();
extern void cseg_2F194();
extern void cseg_2F3AB();
extern void cseg_30BD1();
extern void cseg_8F66C();
extern void SetTeamSecondaryColors();
extern void GetAveragePlayerPriceInSelectedTeams();
extern void GetNumberOfAvailablePlayers();
extern void InitInGameTeamStructure();
extern void Randomize2();
extern void ReadTimerDelta();
extern void ZeroOutStars();
extern void StartingMatch();
extern void StartPenalties();
extern void EndFirstHalf();
extern void EndFirstExtraTime();
extern void EndOfGame();
extern void StartFirstExtraTime();
extern void PlayTrainingGame();

namespace SWOS {
    extern void FixTwoCPUsGameCrash();
    extern void RecalculateReachableEntries();
    extern void RecalculateReachableEntries();
    extern void FixPenaltyBug();
    extern void PlayHeaderComment();
    extern void PlayInjuryComment();
    extern void EnqueueCrowdChantsReload();
    extern void CheckForAmigaModeDirectionFlipBan();
    extern void WriteAmigaModeDirectionFlip();
    extern void WaitRetrace();
    extern void DrawAnimatedPatterns();
    extern void Rand();
    extern void Rand2();
    extern int LoadFile();
    extern int WriteFile();
    extern int GetFilenameAndExtension();
    extern int SelectFileToSaveDialog();
    extern void SWOSMainMenuInit();
    extern void MenuCheckControls();
    extern void ShowMenu();
    extern void DrawMenu();
    extern void DrawMenuItem();
    extern void DrawMultipleItems();
    extern void ActivateMenu();
    extern void SetCurrentEntry();
    extern void DoContinueAbortMenu();
    extern void ShowErrorMenu();
    extern void Player1StatusProc();
    extern void Player2StatusProc();
    extern void ActivateReferee();
    extern void RemoveReferee();
    extern void InitializeInGameTeamsAndStartGame();
    extern void PrepareForInitialKick();
    extern void InitPlayersBeforeEnteringPitch();
    extern void StopAllPlayers();
    extern void SetPlayerWithNoBallDestination();
    extern void SetBallPosition();
    extern void FirstHalfJustEnded();
    extern void PlayersLeavingPitch();
    extern void GoToHalftime();
    extern void CheckIfGoalkeeperClaimedTheBall();
    extern void ToMainGameLoop();
    extern void GoalScored();
    extern void GameOver();
    extern void CalculateDeltaXAndY();
    extern void DrawStatistics();
    extern void ScrollToCurrent();
    extern void InputText();
    extern void TryMidiPlay();
    extern void IntroEnsureFrameDataLoaded();
    extern void IntroDrawFrame();
    extern void CloseSoccerBin();
    extern void SetCurrentPlayerName();
    extern void SwapPlayerNameData();
    extern void PlayMatchSelected();
    extern void PlayPenaltyComment();
    extern void PlayFoulComment();
    extern void PlayDangerousPlayComment();
    extern void PlayGoodTackleComment();
    extern void PlayPostHitComment();
    extern void PlayBarHitComment();
    extern void PlayKeeperClaimedComment();
    extern void PlayNearMissComment();
    extern void PlayGoalkeeperSavedComment();
    extern void PlayOwnGoalComment();
    extern void PlayGoalComment();
    extern void PlayMissGoalSample();
    extern void PlayHomeGoalSample();
    extern void PlayAwayGoalSample();
    extern void PlayRefereeWhistleSample();
    extern void PlayFoulWhistleSample();
    extern void PlayKickSample();
    extern void PlayBallBounceSample();
    extern void PlayFansChant8lSample();
    extern void PlayFansChant10lSample();
    extern void PlayIntroChantSample();
    extern void PlayResultSample();
    extern void EndProgram();
    extern void Int2Ascii();
}

static_assert(sizeof(PackedMenu) == 16, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(GameState) == 2, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(TeamStatsData) == 14, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(FixedPoint) == 4, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(PlayerAnimationTable) == 130, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(PositionsTable) == 72, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(TeamTactics) == 370, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(TeamFile) == 684, "Check @type-sizes in symbols.txt!");
static_assert(sizeof(TeamGame) == 1704, "Check @type-sizes in symbols.txt!");
